===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
BigramLanguageModel                           [1, 1, 65]                --
├─Embedding: 1-1                              [1, 1, 128]               8,320
├─Embedding: 1-2                              [1, 128]                  256
├─Sequential: 1-3                             [1, 1, 128]               --
│    └─Block: 2-1                             [1, 1, 128]               --
│    │    └─LayerNorm: 3-1                    [1, 1, 128]               256
│    │    └─MultiHeadAttention: 3-2           [1, 1, 128]               65,664
│    │    └─LayerNorm: 3-3                    [1, 1, 128]               256
│    │    └─FeedFoward: 3-4                   [1, 1, 128]               131,712
├─LayerNorm: 1-4                              [1, 1, 128]               256
├─Linear: 1-5                                 [1, 1, 65]                8,385
===============================================================================================
Total params: 215,105
Trainable params: 215,105
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.22
===============================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.01
Params size (MB): 0.86
Estimated Total Size (MB): 0.88
===============================================================================================
