==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT_v5                                   [1, 1, 65]                --
├─Embedding: 1-1                         [1, 1, 32]                2,080
├─Embedding: 1-2                         [1, 1, 32]                256
├─MultiHeadAttention: 1-3                [1, 1, 32]                --
│    └─ModuleList: 2-1                   --                        --
│    │    └─Head: 3-1                    [1, 1, 8]                 768
│    │    └─Head: 3-2                    [1, 1, 8]                 768
│    │    └─Head: 3-3                    [1, 1, 8]                 768
│    │    └─Head: 3-4                    [1, 1, 8]                 768
│    └─Linear: 2-2                       [1, 1, 32]                1,056
│    └─Dropout: 2-3                      [1, 1, 32]                --
├─Linear: 1-4                            [1, 1, 65]                2,145
==========================================================================================
Total params: 8,609
Trainable params: 8,609
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.01
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.03
Estimated Total Size (MB): 0.04
==========================================================================================