==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT_v3                                   [1, 1, 65]                --
├─Embedding: 1-1                         [1, 1, 32]                2,080
├─Embedding: 1-2                         [1, 1, 32]                256
├─Linear: 1-3                            [1, 1, 65]                2,145
==========================================================================================
Total params: 4,481
Trainable params: 4,481
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.00
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.02
Estimated Total Size (MB): 0.02
==========================================================================================