==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT_v6                                   [1, 1, 65]                --
├─Embedding: 1-1                         [1, 1, 32]                2,080
├─Embedding: 1-2                         [1, 1, 32]                256
├─MultiHeadAttention: 1-3                [1, 1, 32]                --
│    └─ModuleList: 2-1                   --                        --
│    │    └─Head: 3-1                    [1, 1, 8]                 768
│    │    └─Head: 3-2                    [1, 1, 8]                 768
│    │    └─Head: 3-3                    [1, 1, 8]                 768
│    │    └─Head: 3-4                    [1, 1, 8]                 768
│    └─Linear: 2-2                       [1, 1, 32]                1,056
│    └─Dropout: 2-3                      [1, 1, 32]                --
├─FeedForward: 1-4                       [1, 1, 32]                --
│    └─Sequential: 2-4                   [1, 1, 32]                --
│    │    └─Linear: 3-5                  [1, 1, 128]               4,224
│    │    └─ReLU: 3-6                    [1, 1, 128]               --
│    │    └─Linear: 3-7                  [1, 1, 32]                4,128
│    │    └─Dropout: 3-8                 [1, 1, 32]                --
├─Linear: 1-5                            [1, 1, 65]                2,145
==========================================================================================
Total params: 16,961
Trainable params: 16,961
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.02
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.07
Estimated Total Size (MB): 0.07
==========================================================================================