===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
GPT_v7                                        [1, 1, 65]                --
├─Embedding: 1-1                              [1, 1, 384]               24,960
├─Embedding: 1-2                              [1, 1, 384]               98,304
├─Sequential: 1-3                             [1, 1, 384]               --
│    └─Block: 2-1                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-1                    [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-2           [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-3                    [1, 1, 384]               768
│    │    └─FeedForward: 3-4                  [1, 1, 384]               1,181,568
│    └─Block: 2-2                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-5                    [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-6           [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-7                    [1, 1, 384]               768
│    │    └─FeedForward: 3-8                  [1, 1, 384]               1,181,568
│    └─Block: 2-3                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-9                    [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-10          [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-11                   [1, 1, 384]               768
│    │    └─FeedForward: 3-12                 [1, 1, 384]               1,181,568
│    └─Block: 2-4                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-13                   [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-14          [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-15                   [1, 1, 384]               768
│    │    └─FeedForward: 3-16                 [1, 1, 384]               1,181,568
│    └─Block: 2-5                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-17                   [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-18          [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-19                   [1, 1, 384]               768
│    │    └─FeedForward: 3-20                 [1, 1, 384]               1,181,568
│    └─Block: 2-6                             [1, 1, 384]               --
│    │    └─LayerNorm: 3-21                   [1, 1, 384]               768
│    │    └─MultiHeadAttention: 3-22          [1, 1, 384]               590,208
│    │    └─LayerNorm: 3-23                   [1, 1, 384]               768
│    │    └─FeedForward: 3-24                 [1, 1, 384]               1,181,568
├─LayerNorm: 1-4                              [1, 1, 384]               768
├─Linear: 1-5                                 [1, 1, 65]                25,025
===============================================================================================
Total params: 10,788,929
Trainable params: 10,788,929
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 10.79
===============================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.21
Params size (MB): 43.16
Estimated Total Size (MB): 43.37
===============================================================================================