==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT_v4                                   [1, 1, 65]                --
├─Embedding: 1-1                         [1, 1, 32]                2,080
├─Embedding: 1-2                         [1, 1, 32]                256
├─Head: 1-3                              [1, 1, 32]                --
│    └─Linear: 2-1                       [1, 1, 32]                1,024
│    └─Linear: 2-2                       [1, 1, 32]                1,024
│    └─Linear: 2-3                       [1, 1, 32]                1,024
│    └─Dropout: 2-4                      [1, 1, 1]                 --
├─Linear: 1-4                            [1, 1, 65]                2,145
==========================================================================================
Total params: 7,553
Trainable params: 7,553
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.01
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.03
Estimated Total Size (MB): 0.03
==========================================================================================