===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
GPT_v7                                        [1, 1, 65]                --
├─Embedding: 1-1                              [1, 1, 32]                2,080
├─Embedding: 1-2                              [1, 1, 32]                256
├─Sequential: 1-3                             [1, 1, 32]                --
│    └─Block: 2-1                             [1, 1, 32]                --
│    │    └─LayerNorm: 3-1                    [1, 1, 32]                64
│    │    └─MultiHeadAttention: 3-2           [1, 1, 32]                4,128
│    │    └─LayerNorm: 3-3                    [1, 1, 32]                64
│    │    └─FeedForward: 3-4                  [1, 1, 32]                8,352
│    └─Block: 2-2                             [1, 1, 32]                --
│    │    └─LayerNorm: 3-5                    [1, 1, 32]                64
│    │    └─MultiHeadAttention: 3-6           [1, 1, 32]                4,128
│    │    └─LayerNorm: 3-7                    [1, 1, 32]                64
│    │    └─FeedForward: 3-8                  [1, 1, 32]                8,352
│    └─Block: 2-3                             [1, 1, 32]                --
│    │    └─LayerNorm: 3-9                    [1, 1, 32]                64
│    │    └─MultiHeadAttention: 3-10          [1, 1, 32]                4,128
│    │    └─LayerNorm: 3-11                   [1, 1, 32]                64
│    │    └─FeedForward: 3-12                 [1, 1, 32]                8,352
├─LayerNorm: 1-4                              [1, 1, 32]                64
├─Linear: 1-5                                 [1, 1, 65]                2,145
===============================================================================================
Total params: 42,369
Trainable params: 42,369
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.04
===============================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.01
Params size (MB): 0.17
Estimated Total Size (MB): 0.18
===============================================================================================