==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT_v1                                   [1, 1, 65]                --
├─Embedding: 1-1                         [1, 1, 65]                4,225
==========================================================================================
Total params: 4,225
Trainable params: 4,225
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.00
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.02
Estimated Total Size (MB): 0.02
==========================================================================================